In [1]:
import sqlite3
import pandas as pd

# Create a connection to in-memory database
conn = sqlite3.connect(":memory:")
cursor = conn.cursor()

# Create employees table
cursor.execute("""
CREATE TABLE employees (
    id INTEGER PRIMARY KEY,
    name TEXT,
    age INTEGER,
    department TEXT,
    salary INTEGER
)
""")

# Insert 10 rows
employees_data = [
    (1, "Sonia", 29, "Marketing", 60000),
    (2, "Raj", 35, "Sales", 75000),
    (3, "Nina", 41, "HR", 68000),
    (4, "Amit", 30, "Engineering", 85000),
    (5, "Zara", 27, "Marketing", 62000),
    (6, "Vikram", 45, "Sales", 78000),
    (7, "Meena", 33, "Engineering", 91000),
    (8, "John", 39, "HR", 70000),
    (9, "Anita", 31, "Engineering", 87000),
    (10, "Sam", 28, "Sales", 65000)
]

cursor.executemany("INSERT INTO employees VALUES (?, ?, ?, ?, ?)", employees_data)
conn.commit()
print("Table created and data inserted.")

Table created and data inserted.

In [2]:
df = pd.read_sql_query("SELECT * FROM employees", conn)
print(df)

   id    name  age   department  salary
0   1   Sonia   29    Marketing   60000
1   2     Raj   35        Sales   75000
2   3    Nina   41           HR   68000
3   4    Amit   30  Engineering   85000
4   5    Zara   27    Marketing   62000
5   6  Vikram   45        Sales   78000
6   7   Meena   33  Engineering   91000
7   8    John   39           HR   70000
8   9   Anita   31  Engineering   87000
9  10     Sam   28        Sales   65000

In [3]:
df = pd.read_sql_query("SELECT * FROM employees WHERE age > 30", conn)
print(df)

   id    name  age   department  salary
0   2     Raj   35        Sales   75000
1   3    Nina   41           HR   68000
2   6  Vikram   45        Sales   78000
3   7   Meena   33  Engineering   91000
4   8    John   39           HR   70000
5   9   Anita   31  Engineering   87000

In [4]:
df = pd.read_sql_query("SELECT department, COUNT(*) AS count FROM employees GROUP BY department", conn)
print(df)

    department  count
0  Engineering      3
1           HR      2
2    Marketing      2
3        Sales      3

In [5]:
df = pd.read_sql_query("SELECT MAX(salary) AS highest_salary FROM employees", conn)
print(df)

   highest_salary
0           91000

In [6]:
df = pd.read_sql_query("SELECT department, AVG(salary) AS avg_salary FROM employees GROUP BY department", conn)
print(df)

    department    avg_salary
0  Engineering  87666.666667
1           HR  69000.000000
2    Marketing  61000.000000
3        Sales  72666.666667

In [7]:
query = """
SELECT MAX(salary) AS second_highest_salary
FROM employees
WHERE salary < (SELECT MAX(salary) FROM employees)
"""
df = pd.read_sql_query(query, conn)
print(df)

   second_highest_salary
0                  87000

In [8]:
query = """
SELECT department, COUNT(*) AS num_employees
FROM employees
GROUP BY department
HAVING COUNT(*) > 1
"""
df = pd.read_sql_query(query, conn)
print(df)

    department  num_employees
0  Engineering              3
1           HR              2
2    Marketing              2
3        Sales              3

In [9]:
query = """
SELECT AVG(salary) AS avg_salary_under_30
FROM employees
WHERE age < 30
"""
df = pd.read_sql_query(query, conn)
print(df)

   avg_salary_under_30
0         62333.333333

In [10]:
query = """
SELECT department, SUM(salary) AS total_salary
FROM employees
GROUP BY department
ORDER BY total_salary DESC
LIMIT 1
"""
df = pd.read_sql_query(query, conn)
print(df)

    department  total_salary
0  Engineering        263000

In [11]:
query = """
SELECT *
FROM employees
WHERE name LIKE 'S%'
"""
df = pd.read_sql_query(query, conn)
print(df)

   id   name  age department  salary
0   1  Sonia   29  Marketing   60000
1  10    Sam   28      Sales   65000